{
  "is_dark": true,
  "hero_color": "rgba(0,0,0,1)",
  "hero_image": "\/head_bg.png",
  "bgImage": "\/img\/recruitment\/maniak_bg.png",
  "position": "fullStack",
  "position_desc": "Full Stack developer",
  "phrase": "we're looking for you.",
  "subtitle": "Join the Maniak family! 😍",
  "abstract": "<p>Based in Guadalajara since 2010, MANIAK is a mexican company motivated to generate a change through Software Development tailored to the specific needs of our clients. Our team is composed of a mix of amazingly creative and talented people. Our strength? Helping our customers grow and scale by giving them beautifully crafted and executed projects.<\/p>\n<p>In Maniak we are different. We believe in responsibility and trust, and for that reason, we have a flexible schedule where as long as you fulfill your day\/week activities, office hours don't matter.<\/p>\n<p>We also believe in communication both among team members and different areas. We encourage feedback and aim to strengthen the areas of opportunity of everyone for their professional and personal growth.\n",
  "details": {
    "jobtitle": "Full stack developer",
    "location": "Guadalajara, Mx.",
    "experience": "3+ years",
    "required language": "English",
    "position type": "Full time"
  },
  "requirements": {
    "responsibilities 📌.": {
      "items": [
        "You will develop web applications using PHP or Python as a backend language and Javascript.",
        "You will create concepts, develop, and do testing of user features",
        "Analyze and propose solutions for use cases (user stories).",
        "You will design and implement the general app architecture that includes: Models \/ Migrations, Seeders, Routers, Authentication and Domain Logic"
      ],
      "columns": 2
    },
    "ideal skills 🔍.": {
      "items": [
        "Experience working with relational SQL databases",
        "Experience with distributed caches such as Redis or Memcached.",
        "Experience with one of the following frameworks: Laravel, Django and\/or Rails",
        "Experience developing PHP and\/or Python",
        "Understanding of modern web apps architecture",
        "Knowledge of programming principles: SOLID, DRY, decorators",
        "Experience LESS \/ SASS",
        "Strong experience with vanilla JS",
        "An agile mindset and the ability to adapt to changing priorities and requirements",
        "Ability to learn fast",
        "Experience using git in a collaborative project",
        "Knowledge of common git commands and the ability to manage and fix conflicts."
      ],
      "columns": 2
    },
    "extras 👏.": {
      "items": [
        "Startup experience",
        "Wordpress Development"
      ],
      "columns": 2
    },
    "work environment 🎮.": {
      "items": [
        "Our office is located near from UVM Campus & the Akron Stadium, is made up by 50 members in administrative staff, developers, designers and managers.",
        "We like keeping things casual, that's why we often have bbq's & beers in our own front yard or go to get chicken wings every now and then after work. Also, we have cold beverages like sodas and beers, coffee and tea that you can have anytime, anyday, as long as we don't empty the fridge."
      ],
      "columns": 1
    }
  },
  "perks": [
    {
      "icon": "🍻",
      "description": "BBQ's and beer in our front yard"
    },
    {
      "icon": "🧦",
      "description": "Homeoffice"
    },
    {
      "icon": "🍼",
      "description": "Cold beverages anytime"
    },
    {
      "icon": "🛋",
      "description": "Flexible schedule"
    }
  ]
}